DocumentLoadStoreOptions.determineStreamsShouldOpenForWrite(System.Boolean(*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)[N13],System.Boolean)
determines which streams should be opened from write, according the the store options.
streamShouldOpenForWrites returns the result.
Callers are responsible for cleanup or set the initial state of streamShouldOpenForWrite